<script setup lang="ts">
import { useHead } from '@unhead/vue'

useHead({
  title: '1. メディアコードソート・短冊カウント',
})
</script>

<template>
  <o-article-template title="1. メディアコードソート・短冊カウント">
    <m-article-window head="作業の流れ">
      <template #head>
        <ol>
          <li>短冊がスペース数分連番になっているかチェックする。</li>
          <li>
            <nuxt-link to="/management/media-records">1紙</nuxt-link>を印刷する。
            <a-link-button link="/management/media-records" class="m-10">1紙印刷</a-link-button>
          </li>
          <li>
            短冊の束を、1紙の「メディア」にしたがい分類してカゴに入れる。分類の仕方は以下の通り。なお、この段階では、メディアコード10番のサークル以外は成年向け頒布物有無によるソートを行わない。入れたら、再度枚数チェック（最初に連番チェックをしているので、最後から最初を引いて+1すればいいはず）。「理論SP数」と一致しているなら「短冊カウント」欄に署名。
            <ul>
              <li>落選</li>
              <li>アナログゲームプラン</li>
              <li>デジタルゲームプラン</li>
              <li>なかよしコード</li>
              <li>その他通常の短冊（メディアコード順に分類）</li>
            </ul>
          </li>
          <li>
            データ修正より後に発生した申込情報修正や強制落選等を反映する。サーバー内の配置マスタにも反映することを忘れずに。反映したら1紙の「申込情報変更落選等特殊対応反映」欄に署名してこのページをリロード。
            <ul>
              <li>メディアコードを変更する場合、1紙の「理論SP数」を書き換えることを忘れないように。</li>
            </ul>
          </li>
          <li>
            特殊対応に伴い移動したカゴにつき、再度カウント。変更後の「理論SP数」と合致していれば「特殊対応後短冊カウント」に署名。
          </li>
          <li>
            それぞれのカゴに入っている短冊の枚数を数えて1紙に書き、「理論SP数」と一致するか確認する。一致しなければ再カウントし、それでも一致しなければながたへ。確認できたら「短冊カウント」欄に署名。
          </li>
          <li>通常2SPのサークルの短冊をホチキス留めする。留めたら「2SPホチキス」欄に署名。</li>
          <li>
            合体しているサークルの短冊をホチキス留めする（変則合体でもホチキス留め）。ホチキス留めできたら「合体ホチキス」欄に署名。
          </li>
          <li>
            2SPホチキス留めが正しいか確認する。その際、ホチキス留めした人以外の人がチェックすること。チェックし終えたら「2SPホチキスチェック」欄に署名。
          </li>
          <li>
            合体ホチキス留めが正しいか確認する。その際、ホチキス留めした人以外の人がチェックすること。チェックし終えたら「合体ホチキスチェック」欄に署名。
          </li>
          <li>
            【なかよしコードの短冊のみ】同一のなかよしコードを利用しているサークルの短冊をクリップ留めする。クリップ留めできたら「なかよしクリップ」欄に署名。
          </li>
          <li>
            短冊の「配置希望の補足」欄を1サークル分ずつそれぞれ確認し、「このサークルとは離してほしい/隣接配置しないでほしい」といった記述があれば蛍光ペンでマークし、青付箋を短冊右下側に貼る。
          </li>
          <li>
            植村さんが外周抜きのスプシに入力し終えたらスプシを複数部印刷する。印刷する項目は、「
            <a-link-button
              link="https://docs.google.com/spreadsheets/d/1E3IJQQ4BfxB2aP8A5zAqxWhofwOLUGFtJjwiHpKgPYA/edit#gid=2076896089"
              target="_blank"
              rel="noopener"
              >外周抜きスプシ</a-link-button
            >
          </li>
          <li>
            外周抜きスプシの「今期最高評価」に対応する付箋を短冊に貼る。貼ったら「外周抜き評価付箋貼り」欄に署名。
            <a-sticky-note-color />
          </li>
          <li>
            ここまで無事に終了したら「2.5. 作品コード/成年向け有無ソート・短冊カウント」へ
            <a-link-button link="/management/sakuhin" class="m-10" width="400px"
              >2.5. 作品コード/成年向け有無ソート・短冊カウント</a-link-button
            >
          </li>
        </ol>
      </template>
    </m-article-window>
  </o-article-template>
</template>
